app/controllers/algorithms_controller.rb

      def create
            @algorithm = Algorithm.create(algorithm_params)

            if @algorithm.save
                  require_relative '../../lib/dijkstra.rb'
                  @routes = Route.where(map_id: @algorithm.map_id)

                  @graph = Graph.new
                  (1..6).each {|node| @graph.push node }

                  @routes.each do |route|
---
INSERT INTO `algorithms` (`created_at`, `form_autonomy`, `form_cost`, `form_source`, `form_target`, `form_total`, `map_id`, `updated_at`) VALUES ('2015-02-10 17:09:41', 10.0, 2.5, 1, 3, NULL, 2, '2015-02-10 17:09:41')
SELECT `routes`.* FROM `routes` WHERE `routes`.`map_id` = 2
SELECT `routes`.* FROM `routes` WHERE `routes`.`id` = 2 LIMIT 1