app/controllers/maps_controller.rb

      def index
            @map = Map.all
---
SELECT `maps`.* FROM `maps`

      def show
            @map = Map.find(params[:id])
---
SELECT `maps`.* FROM `maps` WHERE `maps`.`id` = 1 LIMIT 1

      def create
          @map = Map.create(map_params)
---
INSERT INTO `maps` (`autonomy`, `cost`, `created_at`, `name`, `source`, `target`, `updated_at`) VALUES (NULL, NULL, '2015-02-08 03:55:19', 'SP', NULL, NULL, '2015-02-08 03:55:19')