app/controllers/routes_controller.rb

SELECT `maps`.* FROM `maps` WHERE `maps`.`id` = 2 LIMIT 1
SELECT `routes`.* FROM `routes` WHERE `routes`.`map_id` = 2
---
      def index
            mapID = params[:id]
            @map = Map.find(mapID)

            @routes = Route.where(map_id: mapID)

INSERT INTO `routes` (`created_at`, `distance`, `map_id`, `source`, `target`, `updated_at`) VALUES ('2015-02-09 13:11:47', 10.0, NULL, 'A', 'B', '2015-02-09 13:11:47')
---
      def create
             @route = Route.new(route_params)
             @route.save